Catalogs/DMS_СценарииОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_СценарииОбменовДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелИнформационнойБазы</Name>
							<Type>
								<v8:Type>cfg:ExchangePlanRef.DMS_ОбменСАвтосалоном</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортаОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_ВидыТранспортаСообщенийОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_ДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_СценарииОбменовДанными/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем НомерОбрабатываемойСтроки;

&НаКлиенте
Перем КоличествоСтрок;

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = (Объект.Ссылка.Пустая());
	
	УзелИнформационнойБазы = Неопределено;
	
	Если ЭтоНовый
		И Параметры.Свойство("УзелИнформационнойБазы", УзелИнформационнойБазы)
		И УзелИнформационнойБазы <> Неопределено Тогда
		
		Справочники.DMS_СценарииОбменовДанными.ДобавитьЗагрузкуВСценарииОбменаДанными(Объект, УзелИнформационнойБазы);
		Справочники.DMS_СценарииОбменовДанными.ДобавитьВыгрузкуВСценарииОбменаДанными(Объект, УзелИнформационнойБазы);
		
		Наименование = НСтр("ru='Сценарий синхронизации для %1';en='synchronization script for% 1'");
		Объект.Наименование = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Наименование, Строка(УзелИнформационнойБазы));
		
		РасписаниеРегламентногоЗадания = Справочники.DMS_СценарииОбменовДанными.РасписаниеРегламентногоЗаданияПоУмолчанию();
		
		Объект.ИспользоватьРегламентноеЗадание = Истина;
		
	Иначе
		
		// Получаем расписание из самого регламентного задания
		// если РЗ не задано, то расписание = Неопределено и будет создано на клиенте в момент редактирования расписания.
		РасписаниеРегламентногоЗадания = Справочники.DMS_СценарииОбменовДанными.ПолучитьРасписаниеВыполненияОбменаДанными(Объект.Ссылка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеРасписания();
	
	УстановитьДоступностьГиперссылкиНастройкиРасписания();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	Справочники.DMS_СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, РасписаниеРегламентногоЗадания, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_СценарииОбменовДанными", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	УстановитьДоступностьГиперссылкиНастройкиРасписания();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбменаУзелИнформационнойБазыПриИзменении(Элемент)
	
	Элементы.СоставРасписания.ТекущиеДанные.ВидТранспортаОбмена = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаголовокФормы = ?(Заголовок <> Неопределено, Заголовок, НСтр("ru='Комментарий';en='A comment'"));
	ПоказатьФормуРедактированияМногострочногоТекста(Элемент.ТекстРедактирования, ЗаголовокФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуРедактированияМногострочногоТекста(Знач МногострочныйТекст, Знач Заголовок = Неопределено) Экспорт
	
	ТекстВведен = Ложь;
	 
	Если Заголовок = Неопределено Тогда
		ТекстВведен = ВвестиСтроку(МногострочныйТекст,,,Истина);
	Иначе
		ТекстВведен = ВвестиСтроку(МногострочныйТекст, Заголовок,, Истина);
	КонецЕсли;
	
	Если ТекстВведен Тогда
		КомментарийЗавершениеВвода(МногострочныйТекст);
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОбмена

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	Для каждого ТекущаяСтрока Из Объект.НастройкиОбмена Цикл
		
		Отказ = Ложь;
		
		ВыполнитьОбменНаСервере(ТекущаяСтрока.УзелИнформационнойБазы,ТекущаяСтрока.ВидТранспортаОбмена,Отказ);		
	
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменНаСервере(Знач УзелОбмена,Знач ВидТранспорта,Отказ)
	
	ДлительнаяОперация = Ложь;
	ДлительнаяОперацияЗавершена = Ложь;
	ИдентификаторФайлаСообщенияВСервисе = "";
	ИдентификаторДлительнойОперации = "";
		
	ПараметрыАутентификации = Неопределено;
		
	DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Отказ,УзелОбмена,Истина,Ложь,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	
	
	DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Отказ,УзелОбмена,Ложь,Истина,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	

КонецПроцедуры // ВыполнитьОбменНаСервере()
 
&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Команда)
	
	РедактированиеРасписанияРегламентногоЗадания();
	
	ОбновитьПредставлениеРасписания();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомментарийЗавершениеВвода(Знач ВведенныйТекст) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.Комментарий = ВведенныйТекст;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписанияРегламентногоЗадания()
	
	// Если расписание не инициализировано в форме на сервере, то создаем новое.
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	Результат = Диалог.ОткрытьМодально();
	
	Если Результат Тогда		
		РасписаниеРегламентногоЗадания = Диалог.Расписание;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеРасписания()
	
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);
	
	Если ПредставлениеРасписания = Строка(Новый РасписаниеРегламентногоЗадания) Тогда
		
		ПредставлениеРасписания = НСтр("ru='Расписание не задано';en='Schedule is not specified'");
		
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Заголовок = ПредставлениеРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьГиперссылкиНастройкиРасписания()
	
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменДаннымиНаКлиенте()
	
	//Если НомерОбрабатываемойСтроки > КоличествоСтрок Тогда // выход из рекурсии
	//	ВыводитьСостояние = (КоличествоСтрок > 1);
	//	Состояние(НСтр("ru='Данные синхронизированы.';en='The data are synchronized.'"), ?(ВыводитьСостояние, 100, Неопределено));
	//	Возврат; // выходим
	//КонецЕсли;
	//
	//ТекущиеДанные = Объект.НастройкиОбмена[НомерОбрабатываемойСтроки - 1];
	//
	//ВыводитьСостояние = (КоличествоСтрок > 1);
	//
	//СтрокаСообщения = НСтр("ru='Выполняется %1 для %2';en='Running% 1% 2'");
	//СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, 
	//						Строка(ТекущиеДанные.ВыполняемоеДействие),
	//						Строка(ТекущиеДанные.УзелИнформационнойБазы));
	////
	//Прогресс = Окр(100 * (НомерОбрабатываемойСтроки -1) / ?(КоличествоСтрок = 0, 1, КоличествоСтрок));
	//Состояние(СтрокаСообщения, ?(ВыводитьСостояние, Прогресс, Неопределено));
	//
	//// Запускаем выполнение обмена по строке настройки.
	//ВыполнитьОбменДаннымиПоСтрокеНастройки(НомерОбрабатываемойСтроки);
	//
	//ОбработкаПрерыванияПользователя();
	//
	//НомерОбрабатываемойСтроки = НомерОбрабатываемойСтроки + 1;
	//
	//// Рекурсивно вызываем эту процедуру.
	//ПодключитьОбработчикОжидания("ВыполнитьОбменДаннымиНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменДаннымиПоСтрокеНастройки(Знач Индекс)
	
	Отказ = Ложь;
	
	// Запускаем выполнение обмена.
	//ОбменДаннымиСервер.ВыполнитьОбменДаннымиПоСценариюОбменаДанными(Отказ, Объект.Ссылка, Индекс);
		
КонецПроцедуры

//#КонецОбласти
